commit corrections
